r#+TITLE: May 18, 2019 - June 3, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+TODO: TODO IN_PROGRESS | DONE DEFERRED
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-05-18 Sat>
  :wpd-akshay196: 1
  :wpd-gandalfdwite: 1
  :wpd-jasonbraganza: 2
  :wpd-RJ722: 4
  :END:
** akshay196
*** IN_PROGRESS UNIX and Linux System Administration Handbook - Part II [3/8]
    :PROPERTIES:
    :ESTIMATED: 17
    :ACTUAL:   4.78
    :OWNER: akshay196
    :ID: READ.1555438527
    :TASKID: READ.1555438527
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-26 Sun 21:29]--[2019-05-26 Sun 22:02] =>  0:33
    CLOCK: [2019-05-24 Fri 22:28]--[2019-05-24 Fri 23:24] =>  0:56
    CLOCK: [2019-05-23 Thu 21:14]--[2019-05-23 Thu 21:47] =>  0:33
    CLOCK: [2019-05-22 Wed 21:24]--[2019-05-22 Wed 22:13] =>  0:49
    CLOCK: [2019-05-21 Tue 20:55]--[2019-05-21 Tue 21:34] =>  0:39
    CLOCK: [2019-05-20 Mon 19:39]--[2019-05-20 Mon 20:14] =>  0:35
    CLOCK: [2019-05-18 Sat 09:35]--[2019-05-18 Sat 10:17] =>  0:42
    :END:
    - [X] Chapter  9. Cloud Computing                       ( 2h)
      - The cloud in context
      - Cloud platform choices
      - Cloud service fundamentals
      - Clouds: VPS quick start by platform
      - Cost control
    - [X] Chapter 10. Logging                               ( 2h)
      - Log locations
      - The systemd journal
      - Syslog
      - Kernel and boot-time logging
      - Management and rotation of log files
      - Management of logs at scale
      - Logging policies
    - [X] Chapter 11. Drivers and The Kernel                ( 2h)
      - Kernel chores for system administrators
      - Kernel version numbering
      - Devices and their drivers
      - Linux kernel configuration
      - FreeBSD kernel configuration
      - Loadable kernel modules
      - Booting
      - Booting alternate kernels in the cloud
      - Kernel errors
    - [ ] Chapter 12. Printing                              ( 2h)
      - CUPS printing
      - CUPS server administration
      - Troubleshooting tips
    - [ ] Chapter 13. TCP/IP Networking                     ( 3h)
      - TCP/IP and its relationship to the Internet
      - Networking basics
      - Packet addressing
      - IP addresses: the gory details
      - Routing
      - IPv4 ARP and IPv6 neighbor discovery
      - DHCP: the Dynamic Host Configuration Protocol
      - Security issues
      - Basic network configuration
      - Linux networking
      - FreeBSD networking
      - Network troubleshooting
      - Network monitoring
      - Firewalls and NAT
      - Cloud networking
    - [ ] Chapter 14. Physical Networking                   ( 2h)
      - Ethernet: the Swiss Army knife of networking
      - Wireless: Ethernet for nomads
      - SDN: software-defined networking
      - Network testing and debugging
      - Building wiring
      - Network design issues
      - Management issues
      - Recommended vendors
    - [ ] Chapter 15. IP Routing                            ( 2h)
      - Packet forwarding: a closer look
      - Routing daemons and routing protocols
      - Protocols on parade
      - Routing protocol multicast coordination
      - Routing strategy selection criteria
      - Routing daemons
      - Cisco routers
    - [ ] Chapter 16. DNS: Domain Name System               ( 2h)
      - DNS architecture
      - DNS for lookups
      - The DNS namespace
      - How DNS works
      - The DNS database
      - The BIND software
      - Split DNS and the view statement
      - BIND configuration examples
      - Zone file updating
      - DNS security issues
      - BIND debugging
** gandalfdwite
*** IN_PROGRESS Data Structure and Algorithmic Thinking with Python - Part III [3/4]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   8.60
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-30 Thu 22:12]--[2019-05-30 Thu 23:15] =>  1:03
    CLOCK: [2019-05-27 Mon 22:03]--[2019-05-27 Mon 23:06] =>  1:03
    CLOCK: [2019-05-26 Sun 21:40]--[2019-05-26 Sun 22:37] =>  0:57
    CLOCK: [2019-05-23 Thu 21:30]--[2019-05-23 Thu 22:31] =>  1:01
    CLOCK: [2019-05-22 Wed 21:58]--[2019-05-22 Wed 22:57] =>  0:59
    CLOCK: [2019-05-21 Tue 20:47]--[2019-05-21 Tue 21:56] =>  1:09
    CLOCK: [2019-05-19 Sun 21:37]--[2019-05-19 Sun 22:32] =>  0:55
    CLOCK: [2019-05-19 Sun 14:41]--[2019-05-19 Sun 15:49] =>  1:08
    CLOCK: [2019-05-18 Sat 21:10]--[2019-05-18 Sat 21:31] =>  0:21
    :END:

    - [X] 6. Trees                             ( 4h)
    - [X] 7. Priority Queues & Heaps           ( 1h)
    - [X] 8. Disjoint Sets ADT                 ( 1h)
    - [ ] 9. Graph Algorithms                  ( 2h)
*** DONE Python Web Training [1/1]
    CLOSED: [2019-05-25 Sat 15:52]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   3.13
    :OWNER:    gandalfdwite
    :ID:       EVENT.1558150556
    :TASKID:   EVENT.1558150556
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-25 Sat 12:12]--[2019-05-25 Sat 15:20] =>  3:08
    :END:
    - [X] Python online training  (3h)
*** Unix Concepts & Applications by Sumitabha Das - Part III [0/3]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   - [ ] 5. Handling Ordinary files              ( 2h)
   - [ ] 6. Basic file attributes                ( 1h)
   - [ ] 7. Vi editor                            ( 3h)
** jasonbraganza
*** DONE Read and Practice alongside the Mastering Emacs book - Part II [3/3]
    CLOSED: [2019-05-22 Wed 13:19]
   :PROPERTIES: 
   :ESTIMATED: 15
   :ACTUAL:   0.52
   :OWNER: jasonbraganza
   :ID: READ.1557143830
   :TASKID: READ.1557143830
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-22 Wed 13:17]--[2019-05-22 Wed 13:19] =>  0:02
   CLOCK: [2019-05-22 Wed 13:10]--[2019-05-22 Wed 13:17] =>  0:07
   CLOCK: [2019-05-22 Wed 12:48]--[2019-05-22 Wed 13:10] =>  0:22
   :END:
   - [X] The Theory of Editing    (05h)
   - [X] The Practicals of Emacs  (05h)
   - [X] Conclusion               (05h)
*** IN_PROGRESS Work at French, in the Fluent forever app - Part II [12/14]
   :PROPERTIES:
   :ESTIMATED: 17
   :ACTUAL:   8.60
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-31 Fri 11:23]--[2019-05-31 Fri 12:14] =>  0:51
   CLOCK: [2019-05-31 The 21:25]--[2019-05-31 Fri 22:11] =>  0:46
   CLOCK: [2019-05-30 Wed 22:00]--[2019-05-30 Thu 22:42] =>  0:42
   CLOCK: [2019-05-28 Tue 08:28]--[2019-05-28 Tue 09:09] =>  0:41
   CLOCK: [2019-05-27 Mon 07:00]--[2019-05-27 Mon 07:32] =>  0:32
   CLOCK: [2019-05-24 Fri 07:00]--[2019-05-24 Fri 08:15] =>  1:15
   CLOCK: [2019-05-23 Thu 10:08]--[2019-05-23 Thu 10:21] =>  0:13
   CLOCK: [2019-05-23 Thu 07:10]--[2019-05-23 Thu 08:05] =>  0:55
   CLOCK: [2019-05-22 Wed 09:34]--[2019-05-22 Wed 10:35] =>  1:01
   CLOCK: [2019-05-22 Wed 08:58]--[2019-05-22 Wed 09:34] =>  0:36
   CLOCK: [2019-05-18 Sat 20:40]--[2019-05-18 Sat 20:44] =>  0:04
   CLOCK: [2019-05-18 Sat 15:40]--[2019-05-18 Sat 16:40] =>  1:00
   :END:
   - [X] Write a short blog post. Do Review. (1h)
   - [X] Work a pronunciation video (1h)
   - [X] Completed 4 pronunciation lessons (1h)
   - [X] Created 3 grammar flashcards. did 4 review sessions (1h)
   - [X] Completed 5 review sessions, 4 pronunciation lessons, & created 5 vocabulary cards (1h)
   - [X] Completed 5 review sessions, 4 pronunciation lessons, & created 5 vocabulary cards and wrote a short post. (1h)
   - [X] Completed a review session and 2 pronunciation lessons (1h)
   - [X] Completed 4 review sesions, 2 pronunciation lessons  & created 5 vocabulary cards (1h)
   - [X] Completed 1 review session & 4 pronunciation lessons (1h)
   - [X] Completed 1 review session & 4 pronunciation lessons (1h)
   - [X] Completed 1 review session & 4 pronunciation lessons (1h)
   - [X] Write a short blog post. Do Review. (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
*** DONE Read Pym Book [24/24]
    CLOSED: [2019-05-22 Wed 12:45]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   3.90
   :OWNER: jasonbraganza
   :ID: READ.1558193338
   :TASKID: READ.1558193338
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-22 Wed 12:31]--[2019-05-22 Wed 12:45] =>  0:14
   CLOCK: [2019-05-22 Wed 10:36]--[2019-05-22 Wed 12:15] =>  1:39
   CLOCK: [2019-05-21 Tue 14:17]--[2019-05-21 Tue 14:23] =>  0:06
   CLOCK: [2019-05-21 Tue 13:25]--[2019-05-21 Tue 13:35] =>  0:10
   CLOCK: [2019-05-21 Tue 12:23]--[2019-05-21 Tue 13:10] =>  0:47
   CLOCK: [2019-05-21 Tue 12:16]--[2019-05-21 Tue 12:23] =>  0:07
   CLOCK: [2019-05-21 Tue 11:59]--[2019-05-21 Tue 12:16] =>  0:17
   CLOCK: [2019-05-21 Tue 11:25]--[2019-05-21 Tue 11:59] =>  0:34
   :END:
   - [X] Installation
   - [X] The Beginning
   - [X] Using mu editor
   - [X] Variables and Datatypes
   - [X] Operators and expressions
   - [X] If-else , the control flow
   - [X] Looping
   - [X] Data Structures
   - [X] Strings
   - [X] Functions
   - [X] File handling
   - [X] Exceptions
   - [X] Class
   - [X] Modules
   - [X] Collections module
   - [X] Using VS Code as your primary Python editor
   - [X] PEP8 Guidelines
   - [X] Iterators, generators and decorators
   - [X] Virtualenv
   - [X] Type hinting and annotations
   - [X] Simple testing in Python
   - [X] A project structure
   - [X] Building command line applications with Click
   - [X] Introduction to Flask
*** DONE Read Extreme Programming Pocket Guide: Team-Based Software Development [9/9]
    CLOSED: [2019-05-23 Thu 11:35]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:   0.93
   :OWNER: jasonbraganza
   :ID: READ.1558587496
   :TASKID: READ.1558587496
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-23 Thu 11:34]--[2019-05-23 Thu 11:35] =>  0:01
   CLOCK: [2019-05-23 Thu 11:27]--[2019-05-23 Thu 11:33] =>  0:06
   CLOCK: [2019-05-23 Thu 11:25]--[2019-05-23 Thu 11:27] =>  0:02
   CLOCK: [2019-05-23 Thu 11:10]--[2019-05-23 Thu 11:25] =>  0:15
   CLOCK: [2019-05-23 Thu 10:38]--[2019-05-23 Thu 11:10] =>  0:32
   :END:
   - [X] Preface
   - [X] Why XP?
   - [X] Extreme Programming Practices   
   - [X] XP Events
   - [X] Extreme Progamming Artifacts
   - [X] Roles in Extreme Programming
   - [X] Coding, XP Style
   - [X] Adopting XP
   - [X] Further Resources
** RJ722
*** IN_PROGRESS Read "The Great Novel of India" [3/18]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:   2.20
    :OWNER: RJ722
    :ID: READ.1557996292
    :TASKID: READ.1557996292
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-02 Sun 19:54]--[2019-06-02 Sun 21:15] =>  1:21
    CLOCK: [2019-06-02 Sun 09:25]--[2019-06-02 Sun 10:30] =>  1:05
    CLOCK: [2019-05-31 Fri 01:05]--[2019-05-31 Fri 01:52] =>  0:47
    CLOCK: [2019-05-30 Thu 00:05]--[2019-05-30 Thu 00:25] =>  0:20
    :END:
    - [X] The First Book
    - [X] The Second Book
    - [X] The Third Book
    - [ ] The Fourth Book
    - [ ] The Fifth Book
    - [ ] The Sixth Book
    - [ ] The Seventh Book
    - [ ] The Eighth Book
    - [ ] The Ninth Book
    - [ ] The Tenth Book
    - [ ] The Eleventh Book
    - [ ] The Twelfth Book
    - [ ] The Thirteenth Book
    - [ ] The Fourteenth Book
    - [ ] The Fifteenth Book
    - [ ] The Sixteenth Book
    - [ ] The Seventeenth Book
    - [ ] The Eigteenth Book
*** DONE Write blog post [2/2]
    CLOSED: [2019-06-02 Sun 22:56]
    :PROPERTIES:
    :ESTIMATED: 26
    :ACTUAL:   29.35
    :OWNER: RJ722
    :ID: WRITE.1558355651
    :TASKID: WRITE.1558355651
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-30 Thu 11:22]--[2019-05-30 Thu 11:50] =>  0:28
    CLOCK: [2019-05-29 Wed 00:50]--[2019-05-29 Wed 01:35] =>  0:45
    CLOCK: [2019-05-28 Tue 19:51]--[2019-05-28 Tue 21:10] =>  1:19
    CLOCK: [2019-05-28 Tue 19:35]--[2019-05-28 Tue 19:50] =>  0:15
    CLOCK: [2019-05-28 Tue 14:19]--[2019-05-28 Tue 17:09] =>  2:50
    CLOCK: [2019-05-28 Tue 00:42]--[2019-05-28 Tue 04:15] =>  3:33
    CLOCK: [2019-05-27 Mon 20:16]--[2019-05-27 Mon 21:43] =>  1:27
    CLOCK: [2019-05-27 Mon 14:59]--[2019-05-27 Mon 15:31] =>  0:32
    CLOCK: [2019-05-27 Mon 01:55]--[2019-05-27 Mon 02:13] =>  0:18
    CLOCK: [2019-05-25 Sat 16:32]--[2019-05-25 Sat 23:07] =>  6:35
    CLOCK: [2019-05-25 Sat 11:32]--[2019-05-25 Sat 12:32] =>  1:00
    CLOCK: [2019-05-22 Wed 17:46]--[2019-05-23 Thu 00:25] =>  6:39
    CLOCK: [2019-05-22 Wed 00:07]--[2019-05-22 Wed 00:51] =>  0:44
    CLOCK: [2019-05-19 Sun 14:49]--[2019-05-19 Sun 15:00] =>  0:11
    CLOCK: [2019-05-19 Sun 00:52]--[2019-05-19 Sun 03:37] =>  2:45
    :END:
    - [X] Week 1
    - [X] Week 2
    Although I couldn't write daily, but I put in the effort I wanted myself to. Quite happy with it, would love to increase throughput though!
*** Build the profile
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:
    :OWNER: RJ722
    :ID: TASK.1558159427
    :TASKID: TASK.1558159427
    :END:
    - [ ] Follow tags and technologies that you know about
    - [ ] Write a bio for the site
    - [ ] Review their guides
*** Gain 200 reputation
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1558159594
    :TASKID: WRITE.1558159594
    :END:
    Quality answering for 4, 5 questions should suffice.
*** IN_PROGRESS Revise the forgotten history (first three courses)
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: RJ722
    :ID: TASK.1558163860
    :TASKID: TASK.1558163860
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-29 Wed 21:51]--[2019-05-29 Wed 22:09] =>  0:18
    CLOCK: [2019-05-29 Wed 21:05]--[2019-05-29 Wed 21:16] =>  0:11
    :END:
    - [ ] Neural Networks & Deep Learning
    - [ ] Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization
    - [ ] Structuring Machine Learning Projects
